<!-- add-pr-comment:add-pr-comment -->

#### Terraform Plan 📖success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_zip: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=2851a7b3aac1cb95d3336c40a60918b5b6ed706e]
module.daily_snapshot.data.external.sources_zip: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=330983d961b3550a5f4fe8d6798a5bbcd486678a]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=346978865]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=983378cb-189e-437e-af3a-db65127cda4f]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-03-23T14:36:47Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "346978865" -> (known after apply)
      ~ ipv4_address         = "139.59.215.107" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.12" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-snapshot-calibnet"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "99:ea:ec:bf:9f:d1:b2:52:02:b2:78:a2:57:25:a0:e7",
          + "41:91:6d:f9:f7:27:44:30:7f:a4:6f:36:e8:97:ad:cb",
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:346978865" -> (known after apply)
      ~ user_data            = "cbf207292b705d92fb3335423901b9aa5a88db5a" -> "8c42fddace7dd32b1fda773c7cd6b9b82e5e9be8" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 346978865,
        ] -> (known after apply)
        id              = "983378cb-189e-437e-af3a-db65127cda4f"
        name            = "forest-snapshot-calibnet"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:346978865",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "139.59.215.107",
        ],
      + [
          + null,
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>